//全局变量
var G = window.G = {
	//元素宽高
	w:40,
	h:40
};

//下标对应的组件
G.hxs = {
	"1":"floor",
	"2":"walls",
	"3":"end",
	"4":"stone",
	"5":"trap"
};


//==============================预设方块数据(编辑器用)
var MainBox = [];

//通过type获取定义
var getBoxInfoOfType = function(type){
	for(var i in MainBox)
		if(MainBox[i].type == type || G.hxs[MainBox[i].type] == type)
			return MainBox[i];
	for(var i in MainItem)
		if(MainItem[i].type == type || G.hxs[MainItem[i].type] == type)
			return MainItem[i];
}

MainBox.push({
	//方块名称
	name:"无",
	about:"清除地面",
	//展示颜色
	color:"#fff",
	//展示附加html
	html:"",
	type:0
});

MainBox.push({
	//方块名称
	name:"冰面",
	about:"方块在上面移动不会停止",
	//展示颜色
	color:"#87e3ff",
	//展示附加html
	html:"",
	type:1
});

/*MainBox.push({
	//方块名称
	name:"墙壁",
	//展示颜色
	color:"#ccc",
	//展示附加html
	html:"<a style='display:inline-block;width:10px;height:10px;background-color:rgba(0,0,0,0.3);'></a>",
	type:2
});*/

MainBox.push({
	//方块名称
	name:"终点",
	about:"玩家走到这里关卡就结束了",
	//展示颜色
	color:"#19b955",
	//展示附加html
	html:"",
	type:"end",
	//组件参数 key:[type,def,name] type数据类型  name表单文字  def默认值
	args:{
		"num":["number",0,"通关需求值"]
	}
});

MainBox.push({
	//方块名称
	name:"普通地面",
	about:"盒子到上面后会停留，然后可以继续移动",
	//展示颜色
	color:"#ccc",
	//展示附加html
	html:"",
	type:4
});

MainBox.push({
	//方块名称
	name:"陷阱",
	about:"玩家走到这里就失败了",
	//展示颜色
	color:"#ccc",
	//展示附加html
	html:"<a style='color:#555;'>刺</a>",
	type:5
});

MainBox.push({
	//方块名称
	name:"强制转向",
	about:"盒子到上面会强制向一个方向移动",
	//展示颜色
	color:"#f33",
	//展示附加html
	html:"R",
	type:"spd",
	//组件参数 key:[type,def,name] type数据类型  name表单文字  def默认值
	args:{
		"fx":["fx","up","方向"]
	}
});

MainBox.push({
	//方块名称
	name:"地图跳转",
	about:"可以跳转到当前地图层或者其他地图层的指定位置，地图会重置",
	//展示颜色
	color:"#f33",
	//展示附加html
	html:"J",
	type:"jump",
	//组件参数 key:[type,def,name] type数据类型  name表单文字  def默认值
	args:{
		"map":["map",null,"目标地图层"],
		"x":["number",1,"目标格子X"],
		"y":["number",1,"目标格子Y"]
	}
});


//=========================预设物体数据(编辑器用)
var MainItem = [];

MainItem.push({
	//方块名称
	name:"无",
	about:"清除盒子",
	//展示颜色
	color:"#fff",
	//展示附加html
	html:"",
	type:0
});

MainItem.push({
	//方块名称
	name:"墙体",
	about:"盒子无法通过墙体",
	//展示颜色
	color:"#ccc",
	//展示附加html
	html:"<a style='display:inline-block;width:10px;height:10px;background-color:rgba(0,0,0,0.3);'></a>",
	type:"wall"
});

MainItem.push({
	//方块名称
	name:"箱子",
	about:"受到撞击后会移动，盒子无法通过",
	//展示颜色
	color:"#a77649",
	//展示附加html
	html:"箱",
	type:"box"
});

MainItem.push({
	//方块名称
	name:"变色器",
	about:"玩家通过时会将玩家改变为指定的颜色",
	//展示颜色
	color:"#438bf5",
	//展示附加html
	html:"变",
	type:"color-change",
	//组件参数 key:[type,def,name] type数据类型  name表单文字  def默认值
	args:{
		"color":["color","#ff7272","改变的颜色"]
	}
});

MainItem.push({
	//方块名称
	name:"颜色墙",
	about:"玩家只有和墙体一样颜色的时候才可以通过，其他盒子可以自由通过",
	//展示颜色
	color:"#438bf5",
	//展示附加html
	html:"<a style='display:inline-block;width:10px;height:10px;background-color:rgba(0,0,0,0.3);'></a>",
	type:"color-door",
	//组件参数 key:[type,def,name] type数据类型  name表单文字  def默认值
	args:{
		"color":["color","#848484","改变的颜色"]
	}
});

MainItem.push({
	//方块名称
	name:"开关-单次",
	about:"方块经过时被按下，之后一直处于按下状态",
	//展示颜色
	color:"#f33",
	//展示附加html
	html:"1",
	type:"switch-one",
	//组件参数 key:[type,def,name] type数据类型  name表单文字  def默认值
	args:{
		"text":["string","","按钮文字"],
		"x":["string","不筛选","筛选: X"],
		"y":["string","不筛选","筛选: Y"],
		"down-msg":["msg",["end-add",{num:1}],"开关触发"]
	}
});

MainItem.push({
	//方块名称
	name:"开关-多次",
	about:"方块经过时被按下，反复经过可反复触发",
	//展示颜色
	color:"#6188ff",
	//展示附加html
	html:"N",
	type:"switch-many",
	//组件参数 key:[type,def,name] type数据类型  name表单文字  def默认值
	args:{
		"text":["string","","按钮文字"],
		"x":["string","不筛选","筛选: X"],
		"y":["string","不筛选","筛选: Y"],
		"down-msg":["msg",["end-add",{num:1}],"开关触发"]
	}
});

MainItem.push({
	//方块名称
	name:"开关-按压",
	about:"方块经过时被按下，离开时放开，触发不同事件，可反复触发",
	//展示颜色
	color:"#888",
	//展示附加html
	html:"P",
	type:"switch-press",
	//组件参数 key:[type,def,name] type数据类型  name表单文字  def默认值
	args:{
		"text":["string","","按钮文字"],
		"x":["string","不筛选","筛选: X"],
		"y":["string","不筛选","筛选: Y"],
		"down-msg":["msg",["end-add",{num:1}],"按下触发"],
		"up-msg":["msg",["end-add",{num:-1}],"放开触发"]
	}
});

MainItem.push({
	//方块名称
	name:"开关-弹起",
	about:"方块经过时被按下，再次经过时弹起",
	//展示颜色
	color:"#c65dde",
	//展示附加html
	html:"O",
	type:"switch-open",
	//组件参数 key:[type,def,name] type数据类型  name表单文字  def默认值
	args:{
		"text":["string","","按钮文字"],
		"x":["string","不筛选","筛选: X"],
		"y":["string","不筛选","筛选: Y"],
		"down-msg":["msg",["end-add",{num:1}],"按下触发"],
		"up-msg":["msg",["end-add",{num:-1}],"放开触发"]
	}
});









//测试故事
var Story = {"maps":{"1":{"name":"地图1","about":"","map":[[0,1,1,1,1,1,1,1,1,1,0],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,["box",{}],0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":1,"y":1};





//官方预设关卡
var Levels = {};

Levels["1"] = {"maps":{"1":{"name":"地图0","about":"使用键盘[上][下][左][右]移动<br/>移动端则通过[上滑][下滑][左滑][右滑]操作<br/>进入绿色的格子就可以结束关卡","map":[[1,1,1,1,1,1,1],[1,1,1,1,1,1,1],[1,1,1,1,3,1,1],[1,1,1,1,1,1,1],[1,1,1,1,1,1,1]],"item":[[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]],[["wall",{}],0,0,0,0,["wall",{}],["wall",{}]],[["wall",{}],0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,["wall",{}]],[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]]]}},"start":"1","x":"2","y":"2"};

Levels["2"] = {"maps":{"1":{"name":"地图0","map":[[0,0,1,1,1,1,1,1],[0,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,3,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1]],"item":[[0,0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]],[0,["wall",{}],0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,["wall",{}],0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],["wall",{}],["wall",{}],0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]]]}},"start":"1","x":1,"y":"6"};

Levels["3"] = {"maps":{"1":{"name":"地图0","map":[[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,3,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1]],"item":[[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]],[["wall",{}],["wall",{}],0,0,0,0,["wall",{}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,["wall",{}],["wall",{}]],[["wall",{}],0,["wall",{}],0,0,0,0,["wall",{}]],[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]]]}},"start":"1","x":"6","y":"6"};

Levels["4"] = {"maps":{"1":{"name":"地图0","about":"带刺的格子是陷阱<br/>进入到陷阱中将会导致游戏失败","map":[[1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1],[1,1,1,5,1,5,1,5,1,1],[1,1,1,1,3,1,1,1,1,1],[1,1,1,1,5,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1]],"item":[[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,["wall",{}],0,0,["wall",{}],["wall",{}]],[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]]]}},"start":"1","x":"1","y":"4"};

Levels["5"] = {"maps":{"1":{"name":"地图0","about":"白色的地面是普通地面<br/>进入后可以停留在那里","map":[[0,1,1,1,1,1,1,0],[1,1,1,1,1,5,1,1],[1,5,1,4,1,1,1,1],[1,1,1,1,1,4,1,1],[1,1,3,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,5,1,1,1,1,1],[0,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],["wall",{}],0,0,0,0,["wall",{}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],["wall",{}],0,0,0,0,["wall",{}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":"5","y":"6"};

Levels["6"] = {"maps":{"1":{"name":"地图0","map":[[1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,3,1,1,1,1],[1,1,1,1,1,1,1,1,1,1],[1,4,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1]],"item":[[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]],[["wall",{}],0,0,0,0,0,["wall",{}],0,0,["wall",{}]],[["wall",{}],0,["wall",{}],0,0,["wall",{}],0,0,0,["wall",{}]],[["wall",{}],0,0,0,["wall",{}],0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,["wall",{}],0,0,["wall",{}],["wall",{}]],[["wall",{}],0,0,["wall",{}],0,0,["wall",{}],0,0,["wall",{}]],[["wall",{}],0,0,0,["wall",{}],0,0,0,["wall",{}],["wall",{}]],[["wall",{}],0,0,0,0,["wall",{}],0,0,0,["wall",{}]],[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]]]}},"start":"1","x":"4","y":"7"};

Levels["7"] = {"maps":{"1":{"name":"地图0","about":"带箭头的地面是强制转向地面<br/>进入后运动方向会发生变化","map":[[0,1,1,1,1,1,0,0],[1,1,1,1,1,["spd",{"fx":"down"}],1,0],[1,1,1,1,1,1,3,1],[1,1,["spd",{"fx":"right"}],1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,["spd",{"fx":"left"}],1],[0,1,["spd",{"fx":"up"}],1,1,1,1,1],[0,0,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0,0],[["wall",{}],0,0,0,0,0,["wall",{}],0],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[0,["wall",{}],0,0,0,0,0,["wall",{}]],[0,0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":"1","y":"5"};

Levels["8"] = {"maps":{"1":{"name":"地图0","map":[[1,1,1,1,1,1,1,1,1],[1,1,["spd",{"fx":"down"}],1,1,1,1,3,1],[1,1,["spd",{"fx":"down"}],1,["spd",{"fx":"left"}],1,["spd",{"fx":"left"}],["spd",{"fx":"left"}],1],[1,1,1,1,1,1,1,1,1],[1,1,["spd",{"fx":"down"}],1,["spd",{"fx":"up"}],1,["spd",{"fx":"up"}],1,1],[1,1,1,1,1,4,1,1,1],[1,1,["spd",{"fx":"right"}],1,["spd",{"fx":"right"}],1,["spd",{"fx":"up"}],1,1],[1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1]],"item":[[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]],[["wall",{}],0,0,0,["wall",{}],0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]]]}},"start":"1","x":"1","y":"1"};

Levels["9"] = {"maps":{"1":{"name":"地图0","about":"棕色的方块是箱子 碰撞到箱子后箱子会被推开<br/>玩家自身会停下来","map":[[1,1,1,1,1,1,1,1],[1,1,1,1,1,4,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,3,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1]],"item":[[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,["box",{}],0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,["box",{}],0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,["box",{}],0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]]]}},"start":"1","x":"1","y":"6"};

Levels["10"] = {"maps":{"1":{"name":"地图1","map":[[0,0,1,1,1,1,1,1,1,0,0],[0,1,1,1,1,1,1,1,1,1,0],[1,1,1,1,1,1,1,1,4,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,4,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,3,1,1,1,1],[1,1,1,4,1,1,1,4,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,1],[0,0,1,1,1,1,1,1,1,1,1]],"item":[[0,0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0,0],[0,["wall",{}],0,["box",{}],0,0,0,0,0,["wall",{}],0],[["wall",{}],0,["box",{}],0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,["wall",{}],0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["wall",{}],0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[0,["wall",{}],0,0,0,0,0,0,0,0,["wall",{}]],[0,0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]]]}},"start":"1","x":"9","y":"8"};

Levels["11"] = {"maps":{"4":{"name":"地图3","map":[[0,0,0,0,0,0,0,0,0],[0,0,0,0,0,0,0,0,0],[0,0,0,0,0,0,0,1,0],[0,0,0,1,1,1,1,1,1],[0,0,1,1,1,1,1,1,1],[0,1,1,1,4,1,1,1,1],[1,1,1,1,1,1,1,1,1],[0,1,3,1,1,1,1,1,0],[0,0,1,1,0,0,0,0,0]],"item":[[0,0,0,0,0,0,0,0,0],[0,0,0,0,0,0,0,0,0],[0,0,0,0,0,0,0,["wall",{}],0],[0,0,0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],0,["wall",{}]],[0,0,["wall",{}],0,0,0,["wall",{}],["box",{}],["wall",{}]],[0,["wall",{}],["wall",{}],0,0,["box",{}],["box",{}],0,["wall",{}]],[["wall",{}],0,0,0,0,["wall",{}],0,0,["wall",{}]],[0,["wall",{}],0,0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[0,0,["wall",{}],["wall",{}],0,0,0,0,0]]}},"start":"4","x":"7","y":"3"};

Levels["12"] = {"maps":{"1":{"name":"地图1","about":"当终点上出现数字后你需要触发对应数量的按钮才可进入<br/>红色的按钮为单次按钮 按下一次后不可再按","map":[[0,0,1,1,1,1,1,1,1,1,0],[0,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,5,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,["end",{"num":"1"}],1,1],[1,1,1,1,1,1,1,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[0,["wall",{}],0,0,["wall",{}],0,0,0,["wall",{}],0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,0,["wall",{}]],[["wall",{}],0,0,0,0,["box",{}],0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],["box",{}],0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,["box",{}],0,0,0,["wall",{}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],["box",{}],0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":"4","y":"5"};

Levels["13"] = {"maps":{"1":{"name":"地图1","about":"","map":[[0,1,1,1,1,1,1,1,1,1,0],[1,5,5,5,5,["end",{"num":0}],5,5,5,5,1],[1,["spd",{"fx":"right"}],1,1,1,1,1,["spd",{"fx":"down"}],1,["spd",{"fx":"up"}],1],[1,1,["spd",{"fx":"up"}],1,["spd",{"fx":"down"}],1,["spd",{"fx":"left"}],1,["spd",{"fx":"left"}],1,1],[1,["spd",{"fx":"up"}],1,["spd",{"fx":"left"}],1,["spd",{"fx":"up"}],1,["spd",{"fx":"left"}],1,["spd",{"fx":"up"}],1],[1,1,["spd",{"fx":"right"}],1,["spd",{"fx":"right"}],1,["spd",{"fx":"up"}],1,["spd",{"fx":"left"}],1,1],[1,["spd",{"fx":"down"}],1,["spd",{"fx":"up"}],1,["spd",{"fx":"right"}],1,["spd",{"fx":"right"}],1,["spd",{"fx":"up"}],1],[1,1,1,1,1,1,1,1,1,1,1],[1,["spd",{"fx":"up"}],["spd",{"fx":"up"}],["spd",{"fx":"up"}],["spd",{"fx":"up"}],["spd",{"fx":"up"}],["spd",{"fx":"up"}],["spd",{"fx":"up"}],["spd",{"fx":"up"}],["spd",{"fx":"up"}],1],[1,4,4,4,4,4,4,4,4,4,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":"5","y":"9"};

Levels["14"] = {"maps":{"1":{"name":"地图1","about":"","map":[[0,1,1,1,1,1,1,1,1,1,0],[1,1,1,1,1,1,1,1,1,1,1],[1,5,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,["end",{"num":"4"}],1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,5,1],[1,1,1,1,1,1,1,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,["box",{}],0,0,0,["box",{}],["box",{}],0,0,["wall",{}]],[["wall",{}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,0,0,["box",{}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["wall",{}]],[["wall",{}],0,0,0,["box",{}],0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,["box",{}],0,["box",{}],0,0,0,0,0,["wall",{}]],[["wall",{}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":"4","y":"4"};

Levels["15"] = {"maps":{"1":{"name":"地图1","about":"","map":[[0,1,1,1,1,1,1,1,1,1,0],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,["end",{"num":"41"}],1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["box",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["box",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["wall",{}]],[["wall",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["wall",{}]],[["wall",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["box",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["box",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["wall",{}]],[["wall",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["box",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["box",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["box",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["wall",{}]],[["wall",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":"5","y":"6"};

Levels["16"] = {"maps":{"2":{"name":"地图1","about":"","map":[[0,1,1,1,1,1,1,0],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,["end",{"num":"30"}],1,1,1,1,1,1],[0,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["box",{}],["wall",{}]],[["wall",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["box",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["box",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"2","x":"1","y":"6"};

Levels["17"] = {"maps":{"3":{"name":"地图2","about":"蓝色开关是可复用开关<br/>触发后再次进入可以再次触发","map":[[0,1,1,1,1,0],[1,["end",{"num":"30"}],1,1,1,1],[1,1,1,1,1,1],[1,1,1,1,1,1],[1,1,1,1,1,1],[0,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,0,["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,0,["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"3","x":1,"y":1};

Levels["18"] = {"maps":{"4":{"name":"地图3","about":"按钮可以有多种功能，比如旋转强转方向<br/>遇到按钮后可以去多尝试会发生什么哦","map":[[0,0,0,0,1,1,1,0],[0,0,0,1,4,4,4,1],[0,0,0,4,4,4,4,1],[0,1,4,4,4,5,5,1],[1,4,4,4,["spd",{"fx":"up"}],["spd",{"fx":"up"}],["spd",{"fx":"down"}],5],[1,4,4,5,1,["end",{"num":"3"}],1,5],[1,4,4,5,["spd",{"fx":"up"}],1,["spd",{"fx":"up"}],5],[0,1,1,1,5,5,5,0]],"item":[[0,0,0,0,["wall",{}],["wall",{}],["wall",{}],0],[0,0,0,["wall",{}],["switch-many",{"text":"","x":"4","y":"不筛选","down-msg":["spd-rotate",{"num":1}]}],["switch-many",{"text":"","x":"5","y":"","down-msg":["spd-rotate",{"num":1}]}],["switch-many",{"text":"","x":"6","y":"","down-msg":["spd-rotate",{"num":1}]}],["wall",{}]],[0,0,0,["wall",{}],0,0,0,["wall",{}]],[0,["wall",{}],["wall",{}],0,0,0,0,["wall",{}]],[["wall",{}],["switch-many",{"text":"","x":"不筛选","y":"4","down-msg":["spd-rotate",{"num":"1"}]}],0,0,0,0,0,0],[["wall",{}],0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0],[["wall",{}],["switch-many",{"text":"","x":"不筛选","y":"6","down-msg":["spd-rotate",{"num":1}]}],0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,0],[0,["wall",{}],["wall",{}],["wall",{}],0,0,0,0]]}},"start":"4","x":"3","y":"3"};

Levels["19"] = {"maps":{"1":{"name":"地图1","about":"","map":[[0,1,1,1,1,1,1,1,1,1,0],[1,1,1,1,1,1,5,1,1,1,1],[1,1,4,1,1,1,["spd",{"fx":"left"}],1,1,1,1],[1,1,1,1,1,1,5,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,["end",{"num":"2"}],4,1,1,1,5,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,5,1,1,1,1],[1,1,4,1,1,1,["spd",{"fx":"up"}],1,1,1,1],[1,1,1,1,1,1,5,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["spd-rotate",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]],[["wall",{}],0,0,["box",{}],["box",{}],["box",{}],0,["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["spd-rotate",{"num":1}]}],["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["spd-rotate",{"num":1}]}],0,["wall",{}]],[["wall",{}],0,0,0,0,0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["spd-rotate",{"num":1}]}],0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":"2","y":"2"};

Levels["20"] = {"maps":{"1":{"name":"地图1","about":"","map":[[0,1,1,1,1,1,1,1,1,1,0],[1,1,1,1,1,1,5,1,1,1,1],[1,1,4,1,1,1,5,1,["spd",{"fx":"right"}],1,1],[1,1,1,1,1,1,5,1,1,1,1],[1,1,1,1,1,1,5,1,1,1,1],[1,["end",{"num":"4"}],4,1,1,1,5,1,["spd",{"fx":"down"}],1,1],[1,1,1,1,1,1,5,1,1,1,1],[1,1,1,1,1,1,5,1,1,1,1],[1,1,4,1,1,1,5,1,["spd",{"fx":"left"}],1,1],[1,1,1,1,1,1,5,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["wall",{}]],[["wall",{}],0,0,["box",{}],0,0,0,0,0,["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["spd-rotate",{"num":1}]}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["spd-rotate",{"num":1}]}],0,["wall",{}]],[["wall",{}],0,0,["box",{}],["box",{}],0,0,0,0,["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["spd-rotate",{"num":1}]}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["spd-rotate",{"num":1}]}],0,["wall",{}]],[["wall",{}],0,0,["box",{}],["box",{}],0,0,0,0,["switch-many",{"text":"","x":"不筛选","y":"不筛选","down-msg":["spd-rotate",{"num":1}]}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":"2","y":"2","name":"测试地图"};

Levels["21"] = {"maps":{"2":{"name":"图层1","about":"黑色的按钮是按压按钮<br/>按下后生效 放开后失效","map":[[0,1,1,1,1,1,0],[1,1,1,1,1,1,1],[1,1,1,1,1,1,1],[1,1,["end",{"num":"3"}],1,1,1,1],[1,1,1,1,1,1,1],[1,1,1,1,1,1,1],[0,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,0,["box",{}],0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],0,0,0,["box",{}],0,["wall",{}]],[["wall",{}],0,0,0,0,0,["wall",{}]],[["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,["box",{}],0,0,["wall",{}]],[["wall",{}],0,0,0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"2","x":1,"y":1,"name":"测试地图"};

Levels["22"] = {"maps":{"3":{"name":"图层2","about":"来一句轻松愉快的推箱子吧","map":[[0,0,1,1,1,0,0,0],[0,0,1,1,1,0,0,0],[0,0,1,1,1,1,1,1],[1,1,1,1,["end",{"num":"4"}],1,1,1],[1,1,1,4,4,1,1,1],[1,1,1,1,1,1,0,0],[0,0,0,1,1,1,0,0],[0,0,0,1,1,1,0,0]],"item":[[0,0,["wall",{}],["wall",{}],["wall",{}],0,0,0],[0,0,["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],0,0,0],[0,0,["wall",{}],0,["wall",{}],["wall",{}],["wall",{}],["wall",{}]],[["wall",{}],["wall",{}],["wall",{}],["box",{}],0,["box",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,["box",{}],["box",{}],["wall",{}],["wall",{}],["wall",{}]],[["wall",{}],["wall",{}],["wall",{}],["wall",{}],0,["wall",{}],0,0],[0,0,0,["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],0,0],[0,0,0,["wall",{}],["wall",{}],["wall",{}],0,0]]}},"start":"3","x":"4","y":"3","name":"测试地图"};

Levels["23"] = {"maps":{"4":{"name":"图层3","about":"","map":[[0,1,1,1,1,1,1,1,1,1,0],[1,1,1,1,1,5,1,1,1,1,1],[1,1,1,1,1,5,1,1,1,1,1],[1,1,1,1,1,5,1,1,1,1,1],[1,1,4,1,1,5,1,1,1,1,1],[1,["end",{"num":"8"}],4,1,1,5,1,1,1,["spd",{"fx":"right"}],1],[1,1,4,1,1,5,1,1,1,1,1],[1,1,1,1,1,5,1,1,1,1,1],[1,1,1,1,1,5,1,1,1,1,1],[1,1,1,1,1,5,1,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,0,0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["spd-rotate",{"num":1}],"up-msg":["spd-rotate",{"num":"-1"}]}],0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,0,["box",{}],["box",{}],0,0,0,0,0,["wall",{}]],[["wall",{}],0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["spd-rotate",{"num":"-1"}],"up-msg":["spd-rotate",{"num":1}]}],0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,["switch-one",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}]}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"4","x":"2","y":"5","name":"测试地图"};

Levels["24"] = {"maps":{"1":{"name":"地图1","about":"","map":[[0,1,1,1,1,1,1,1,1,1,0],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,["end",{"num":"8"}],1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,0,0,0,0,["box",{}],0,0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],0,0,0,0,0,["box",{}],0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,["box",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["box",{}],0,0,["box",{}],0,0,["wall",{}]],[["wall",{}],["box",{}],0,0,0,["box",{}],0,0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,["box",{}],0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,0,0,0,0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":"3","y":"2","name":"测试地图"}

Levels["25"] = {"maps":{"4":{"name":"图层3","about":"","map":[[0,1,1,1,1,1,1,0],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,["end",{"num":0}],1],[0,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,0,0,["box",{}],["box",{}],["box",{}],["wall",{}]],[["wall",{}],0,0,["box",{}],0,["box",{}],["box",{}],["wall",{}]],[["wall",{}],0,["box",{}],["box",{}],["box",{}],0,["box",{}],["wall",{}]],[["wall",{}],["box",{}],0,["box",{}],["box",{}],["box",{}],0,["wall",{}]],[["wall",{}],["box",{}],["box",{}],0,["box",{}],0,0,["wall",{}]],[["wall",{}],["box",{}],["box",{}],["box",{}],0,0,0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"4","x":"1","y":"1","name":"测试地图"};

Levels["26"] = {"maps":{"4":{"name":"图层3","about":"有时按钮被按下未必降低终点需求值<br/>也可能增加需求值","map":[[0,1,1,1,1,1,1,0],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1],[1,1,1,1,1,1,["end",{"num":0}],1],[0,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,0,["box",{}],0,["box",{}],0,["wall",{}]],[["wall",{}],0,["box",{}],0,["box",{}],["switch-press",{"text":"+","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":"-1"}],"up-msg":["end-add",{"num":"1"}]}],["box",{}],["wall",{}]],[["wall",{}],["box",{}],0,["box",{}],["switch-press",{"text":"+","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":"-1"}],"up-msg":["end-add",{"num":"1"}]}],["box",{}],0,["wall",{}]],[["wall",{}],0,["box",{}],["switch-press",{"text":"+","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":"-1"}],"up-msg":["end-add",{"num":"1"}]}],["box",{}],["switch-press",{"text":"+","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":"-1"}],"up-msg":["end-add",{"num":"1"}]}],["box",{}],["wall",{}]],[["wall",{}],["box",{}],["switch-press",{"text":"+","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":"-1"}],"up-msg":["end-add",{"num":"1"}]}],["box",{}],0,["box",{}],0,["wall",{}]],[["wall",{}],0,["box",{}],["switch-press",{"text":"+","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":"-1"}],"up-msg":["end-add",{"num":"1"}]}],["box",{}],0,0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"4","x":"1","y":"1","name":"测试地图"};

Levels["27"] = {"maps":{"5":{"name":"图层4","about":"","map":[[0,1,1,1,1,1,1,1,0],[1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1],[1,1,["end",{"num":"13"}],1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1],[0,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["box",{}],0,0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],0,0,0,0,["box",{}],0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],0,["box",{}],["box",{}],0,["box",{}],0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["box",{}],0,0,["box",{}],0,0,["box",{}],["wall",{}]],[["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,["box",{}],0,["box",{}],["box",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,["box",{}],0,0,0,0,["wall",{}]],[["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,0,["box",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"5","x":"1","y":"1","name":"测试地图"};

Levels["28"] = {"maps":{"2":{"name":"图层1","about":"半透明的墙需要和墙体相同颜色才可以通过<br/>闪烁的圆圈可以改变玩家的颜色","map":[[0,1,1,1,1,1,1,1,0],[1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,["end",{"num":0}],1],[0,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],["color-change",{"color":"#61e473"}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],["color-door",{"color":"#61e473"}],["color-door",{"color":"#61e473"}],["color-door",{"color":"#61e473"}],["color-door",{"color":"#61e473"}],["color-door",{"color":"#61e473"}],["color-door",{"color":"#61e473"}],["color-door",{"color":"#61e473"}],["wall",{}]],[["wall",{}],0,0,0,0,0,0,["color-change",{"color":"#848484"}],["wall",{}]],[["wall",{}],["color-door",{"color":"#848484"}],["color-door",{"color":"#848484"}],["color-door",{"color":"#848484"}],["color-door",{"color":"#848484"}],["color-door",{"color":"#848484"}],["color-door",{"color":"#848484"}],["color-door",{"color":"#848484"}],["wall",{}]],[["wall",{}],["color-change",{"color":"#d854d2"}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],["color-door",{"color":"#d854d2"}],["color-door",{"color":"#d854d2"}],["color-door",{"color":"#d854d2"}],["color-door",{"color":"#d854d2"}],["color-door",{"color":"#d854d2"}],["color-door",{"color":"#ff7272"}],["color-door",{"color":"#ff7272"}],["wall",{}]],[["wall",{}],0,0,0,0,["color-change",{"color":"#ff7272"}],["color-door",{"color":"#ff7272"}],0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"2","x":"7","y":1,"name":"测试地图"};

Levels["29"] = {"maps":{"1":{"name":"地图1","about":"","map":[[0,1,1,1,1,1,1,1,1,1,0],[1,1,1,1,1,["end",{"num":"4"}],1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,["color-door",{"color":"#848484"}],0,0,0,0,0,0,["wall",{}]],[["wall",{}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,["color-door",{"color":"#848484"}],0,["box",{}],0,0,0,0,["wall",{}]],[["wall",{}],0,0,["color-door",{"color":"#848484"}],0,0,0,["color-door",{"color":"#848484"}],["color-door",{"color":"#848484"}],["color-door",{"color":"#848484"}],["wall",{}]],[["wall",{}],0,0,["color-door",{"color":"#848484"}],0,0,0,["color-door",{"color":"#848484"}],0,0,["wall",{}]],[["wall",{}],0,0,["color-door",{"color":"#848484"}],["box",{}],0,["box",{}],["color-door",{"color":"#848484"}],0,0,["wall",{}]],[["wall",{}],0,0,["color-door",{"color":"#848484"}],0,0,0,["color-door",{"color":"#848484"}],0,0,["wall",{}]],[["wall",{}],["color-door",{"color":"#848484"}],["color-door",{"color":"#848484"}],["color-door",{"color":"#848484"}],0,0,0,["color-door",{"color":"#848484"}],0,0,["wall",{}]],[["wall",{}],0,0,0,0,["box",{}],0,["color-door",{"color":"#848484"}],0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,["color-door",{"color":"#848484"}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":"5","y":"5","name":"测试地图"};

Levels["30"] = {"maps":{"1":{"name":"地图1","about":"","map":[[0,1,1,1,1,1,1,1,1,1,0],[1,1,1,1,1,4,1,1,1,1,1],[1,1,1,1,4,1,1,1,1,1,1],[1,1,1,4,1,1,1,1,1,1,1],[1,1,4,1,1,1,1,1,1,1,1],[1,4,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,["end",{"num":"3"}],1,1,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,["color-door",{"color":"#848484"}],["color-door",{"color":"#d854d2"}],0,0,0,0,0,["color-door",{"color":"#848484"}],["wall",{}]],[["wall",{}],["color-door",{"color":"#848484"}],["color-door",{"color":"#61e473"}],0,0,0,0,["box",{}],["color-door",{"color":"#ff7272"}],0,["wall",{}]],[["wall",{}],["color-door",{"color":"#ff7272"}],0,0,0,0,0,["color-door",{"color":"#61e473"}],0,0,["wall",{}]],[["wall",{}],0,0,0,0,["box",{}],["color-door",{"color":"#d854d2"}],0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,["color-door",{"color":"#848484"}],0,0,0,0,["wall",{}]],[["wall",{}],0,0,["box",{}],["color-door",{"color":"#d854d2"}],0,0,0,0,["color-change",{"color":"#ff7272"}],["wall",{}]],[["wall",{}],0,0,["color-door",{"color":"#61e473"}],0,0,0,0,["color-change",{"color":"#848484"}],0,["wall",{}]],[["wall",{}],0,["color-door",{"color":"#ff7272"}],0,0,0,0,["color-change",{"color":"#61e473"}],0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["color-door",{"color":"#848484"}],0,0,0,0,["color-change",{"color":"#d854d2"}],0,["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-press",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":"8","y":"8","name":"测试地图"};

Levels["31"] = {"maps":{"2":{"name":"图层1","about":"","map":[[0,1,1,1,1,1,0],[1,1,1,1,1,1,1],[1,1,1,1,1,1,1],[1,1,1,1,1,1,1],[1,1,1,1,1,1,1],[1,1,1,1,1,["end",{"num":0}],1],[0,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,["color-change",{"color":"#848484"}],["color-door",{"color":"#848484"}],["color-change",{"color":"#d854d2"}],["color-door",{"color":"#d854d2"}],["wall",{}]],[["wall",{}],["color-change",{"color":"#61e473"}],["color-door",{"color":"#848484"}],["color-change",{"color":"#d854d2"}],["color-door",{"color":"#d854d2"}],["color-change",{"color":"#ff7272"}],["wall",{}]],[["wall",{}],["color-door",{"color":"#61e473"}],["color-change",{"color":"#ff7272"}],["color-door",{"color":"#848484"}],["color-change",{"color":"#61e473"}],["color-door",{"color":"#848484"}],["wall",{}]],[["wall",{}],["color-change",{"color":"#848484"}],["color-door",{"color":"#848484"}],["color-change",{"color":"#ff7272"}],["color-door",{"color":"#ff7272"}],0,["wall",{}]],[["wall",{}],["color-door",{"color":"#848484"}],["color-change",{"color":"#ff7272"}],["color-door",{"color":"#848484"}],0,0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"2","x":"1","y":"1","name":"测试地图"};

Levels["32"] = {"maps":{"1":{"name":"图层0","about":"紫色的开关是弹起开关<br/>按下后再次经过会弹起","map":[[0,1,1,1,0],[1,["end",{"num":"7"}],4,4,1],[1,4,4,4,1],[1,4,4,4,1],[0,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":1,"y":1,"name":"测试地图"};

Levels["33"] = {"maps":{"2":{"name":"图层1","about":"","map":[[0,4,4,4,4,4,0],[4,["end",{"num":"21"}],4,4,4,4,4],[4,4,4,4,4,4,4],[4,4,4,4,4,4,4],[4,4,4,4,4,4,4],[4,4,4,4,4,4,4],[0,4,4,4,4,4,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"2","x":1,"y":1,"name":"测试地图"};

Levels["34"] = {"maps":{"3":{"name":"图层2","about":"","map":[[0,4,4,4,4,4,4,4,4,4,0],[4,4,4,4,4,4,4,4,4,4,4],[4,4,4,4,4,4,4,4,4,4,4],[4,4,4,4,4,4,4,4,4,4,4],[4,4,4,4,4,["end",{"num":"68"}],4,4,4,4,4],[4,4,4,4,4,4,4,4,4,4,4],[4,4,4,4,4,4,4,4,4,4,4],[4,4,4,4,4,4,4,4,4,4,4],[4,4,4,4,4,4,4,4,4,4,4],[4,4,4,4,4,4,4,4,4,4,4],[0,4,4,4,4,4,4,4,4,4,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],0,["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}]],[["wall",{}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["switch-open",{"text":"","x":"不筛选","y":"不筛选","down-msg":["end-add",{"num":1}],"up-msg":["end-add",{"num":-1}]}],["wall",{}],["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"3","x":"5","y":"4","name":"测试地图"};



//Levels["3"] = {"maps":{"1":{"name":"地图1","map":[[0,1,1,1,1,1,1,1,1,1,0],[1,1,1,1,1,1,1,1,4,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,4,1,1,4,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,3,4,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,1,1,1,1,1,1,1,1],[1,1,1,4,1,1,1,1,4,1,1],[1,1,1,1,1,1,1,1,1,1,1],[0,1,1,1,1,1,1,1,1,1,0]],"item":[[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[["wall",{}],0,0,0,0,0,0,0,0,0,["wall",{}]],[0,["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],["wall",{}],0]]}},"start":"1","x":1,"y":1};


